#include "interrupt.h"

//==================================================
// 函数功能：外部中断0
// 输入参数：无
// 输出参数：无
//==================================================
void exint0_init(void)
{
	IT0=1;			// 下降沿触发
	EX0=1;
	EA=1;
	INT0=1;
}
void exint0() interrupt 0
{
	
}

//==================================================
// 函数功能：定时器中断0
// 输入参数：无
// 输出参数：无
//==================================================
void timer0_init(void)
{
	TMOD=0x01;
	TH0=(65536-46080)/256;
	TL0=(65536-46080)%256;
	ET0=1;
	EA=1;
	TR0=1;
}
void timer0() interrupt 1
{
	TH0=(65536-46080)/256;
	TL0=(65536-46080)%256;
}

//==================================================
// 函数功能：外部中断1
// 输入参数：无
// 输出参数：无
//==================================================
void exint1_init(void)
{
	IT1=1;			// 下降沿触发
	EX1=1;
	EA=1;
}
void exint1() interrupt 2
{
	
}

//==================================================
// 函数功能：定时器中断1
// 输入参数：无
// 输出参数：无
//==================================================
void timer1_init(void)
{
	TMOD=0x20;
	TH1=0xfd;
	TL1=0xfd;
	TR1=1;
	
	SM0=0;
	SM1=1;
	REN=1;
	ES=1;
	EA=1;
}
void timer1() interrupt 3
{
	
}

//==================================================
// 函数功能：串口中断
// 输入参数：无
// 输出参数：无
//==================================================
void serial() interrupt 4
{
	uchar a;
	if(RI==1){
		RI=0;
		a=SBUF;
	}
}

//==================================================
// 函数功能：发送字符
// 输入参数：字符ch
// 输出参数：无
//==================================================
void send_char(uchar ch)
{
	SBUF=ch;
	while(!TI);
	TI=0;
}

//==================================================
// 函数功能：发送字符串
// 输入参数：字符串str
// 输出参数：无
//==================================================
void send_string(uchar ch, uchar *str)
{
	uint k=0;
	send_char(ch);
	while(*(str+k)!='\0')
	{
		send_char(*(str+k));
		k++;
	}
	send_char('\0');
}

//==================================================
// 函数功能：定时器中断2
// 输入参数：无
// 输出参数：无
//==================================================
void timer2_init(void)
{
	RCAP2H=(65536-46080)/256;
	RCAP2L=(65536-46080)%256;
	ET2=1;
	TR2=1;
	EA=1;
}
void timer2() interrupt 5
{
	//TF2=0;
}

//==================================================
// 函数功能：外部中断2
// 输入参数：无
// 输出参数：无
//==================================================
void exint2() interrupt 6
{
	
}

//==================================================
// 函数功能：外部中断3
// 输入参数：无
// 输出参数：无
//==================================================
void exint3() interrupt 7
{
	
}