#include "led.h"

//==================================================
// 函数声明
//==================================================
void led_out(uchar ch);

//==================================================
// 常量定义
//==================================================
uchar code BIT[]={0x80,0x40,0x20,0x10,0x08,0x04,0x02,0x01};
uchar code LED_CODE[] =
{// 0    1    2    3    4    5    6    7    8    9
	 0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90
};
uchar code LED_CODE_DOT[] =
{// 0.   1.   2.   3.   4.   5.   6.   7.   8.   9. 
	 0x40,0x79,0x24,0x30,0x19,0x12,0x02,0x78,0x00,0x10
};

//==================================================
// 函数功能：数据传输
// 输入参数：字符x
// 输出参数：无
//==================================================
void led_out(uchar ch)
{
	uchar i;
	for(i=8;i>=1;i--)
	{
		if (ch&0x80) DIO=1; 
		else DIO=0;
		ch<<=1;
		SCK = 0;
		SCK = 1;
	}
}

//==================================================
// 函数功能：LED显示
// 输入参数：无
// 输出参数：无
//==================================================
void led_display(uchar *led_buff)
{
	uchar i,j;
	for(i=0,j=0;i<8;i++,j++)
	{
		if(led_buff[j]==0) break;
		if(led_buff[j+1]=='.')
		{
			led_out(*(LED_CODE_DOT + led_buff[j] - 48));
			j++;
		}
		else
		{
			led_out(*(LED_CODE + led_buff[j] - 48));
		}
		led_out(*(BIT+i));
		
		RCK = 0;
		RCK = 1;
	}
	for(;i<8;i++)
	{
		led_out(0xff);
		led_out(*(BIT+i));
		
		RCK = 0;
		RCK = 1;
	}
}
